{"title": "Frustrated with iCloud, Apple's developer community speaks up en masse", "desc": "Apple's iCloud is marketed to us end users as a convenient and centralized way to manage data on all of our Macs and iOS devices: sync contacts and bookmarks, re-download music and apps, back up iOS devices &hellip;", "link": "http://arstechnica.com/apple/2013/03/frustrated-with-icloud-apples-developer-community-speaks-up-en-masse/", "cat": "news"}
{"title": "FCC finally opens review of cell phone safety standards", "desc": "Nine months after the FCC said it would take a closer look at its standards for cell phone safety to see if the agency needs to revise the 15-year-old guidelines, it finally opened the official inquiry", "link": "http://news.cnet.com/8301-13578_3-57577100-38/fcc-finally-opens-review-of-cell-phone-safety-standards/", "cat": "news"}
{"title": "Bump your stalking skills with custom geofences in Apple's Find My Friends", "desc": "Do you enjoy stalking your friends and family via Apple's Find My Friends app?&nbsp; If you're a regular user of the &ldquo;Notify Me&rdquo; feature, which allows you to receive push alerts when a friend arrives or leaves a location &hellip;", "link": "http://arstechnica.com/apple/2013/03/bump-your-stalking-skills-with-custom-geofences-in-apples-find-my-friends/", "cat": "news"}
{"title": "Tumblr undergoes 3-hour outage due to &lsquo;network issues&rsquo; [updated]", "desc": "Tumblr has confirmed that its blogging service is down yet again. &ldquo;We're experiencing networking issues and are working quickly to remedy the situation,&rdquo; a spokersperson told The Next Web.", "link": "http://thenextweb.com/insider/2013/03/30/tumblr-confirms-site-wide-outage-says-it-is-working-quickly-to-remedy-the-situation/", "cat": "news"}
{"title": "Demand Surges for Supercomputers", "desc": "Demand is suddenly surging for the largest scientific computers, driven by technology changes seen in two powerful systems unveiled this week. The supercomputers, installed in Illinois and Texas&mdash;each requiring about the space of a basketball court &hellip;", "link": "http://online.wsj.com/article_email/SB10001424127887323361804578388531030341090-lMyQjAxMTAzMDIwODEyNDgyWj.html", "cat": "news"}
{"title": "iMessage denial of service &lsquo;prank&rsquo; spams users rapidly with messages, crashes iOS Messages app", "desc": "Over the last couple of days, a group of iOS developers has been targeted with a series of rapid-fire texts sent over Apple's iMessage system.&nbsp; The messages, likely transmitted via &hellip;", "link": "http://thenextweb.com/apple/2013/03/29/imessage-denial-of-service-prank-spams-users-rapidly-with-messages-crashes-ios-messages-app/", "cat": "news"}
{"title": "Marissa Mayer Tells The Story Of Why She Became Yahoo CEO, Even Though She Was About To Have A Kid", "desc": "Marissa Mayer told the story today of how she became Yahoo's CEO, even though she was pregnant. It was part of Sheryl Sandberg's &ldquo;Lean In&rdquo; series, which promotes women talking about succeeding in life and business.", "link": "http://www.businessinsider.com/marissa-mayer-tells-the-story-of-why-became-yahoo-ceo-2013-3?op=1", "cat": "news"}
{"title": "Music Executive: &lsquo;iRadio is Coming&rsquo;, Apple Pushing for Summer Launch", "desc": "Negotiations between Apple and record companies regarding Apple's rumored &lsquo;iRadio&rsquo; music service are progressing, The Verge reports as one tidbit in a larger article about the music industry in general.", "link": "http://www.macrumors.com/2013/03/29/music-executive-iradio-is-coming-apple-pushing-for-summer-launch/", "cat": "news"}
{"title": "LivingSocial Co-Founder And CTO Aaron Batalion To Leave The Company", "desc": "Aaron Batalion, the co-founder and CTO of daily deals site LivingSocial, is leaving the company.&nbsp; He announced his departure in a post on his personal blog published Friday afternoon. Here is the full text of his blog post:", "link": "http://techcrunch.com/2013/03/29/livingsocial-co-founder-and-cto-aaron-batalion-to-leave-the-company/", "cat": "news"}
{"title": "2020 Census will be done by Internet", "desc": "Add paper census questionnaires to the long list of everyday items becoming quaint vestiges of tired technology, like landline phones, television armoires and butterfly ballots. The Census Bureau already has started offering an Internet option &hellip;", "link": "http://www.washingtonpost.com/local/2020-census-will-be-done-by-internet/2013/03/28/08453c72-97d8-11e2-b68f-dc5c4b47e519_story.html", "cat": "news"}
{"title": "Biting the hand that feeds you: why are record labels fighting Pandora?", "desc": "Labels want streaming and web radio to grow the pie, but want their share too A few years ago, leaders from the major record companies planted the seeds from which they hoped would spring the next generation of music distributors.", "link": "http://www.theverge.com/2013/3/29/4160700/biting-the-hand-that-feeds-you-why-are-record-labels-fighting-pandora", "cat": "news"}
{"title": "Dell Proxy Describes Downbeat Forecast", "desc": "Dell Inc. described bleak prospects for its business and the personal computer industry as it laid out its most comprehensive case for accepting a $24.4 billion offer to go private, a decision that kicked off a high-stakes poker game between potential bidders for the computer maker.", "link": "http://online.wsj.com/article_email/SB10001424127887323501004578390692268605644-lMyQjAxMTAzMDIwOTEyNDkyWj.html", "cat": "news"}
{"title": "Change of heart?&nbsp; IE11 might speed Web graphics with WebGL", "desc": "A leaked build of Microsoft's next browser shows signs that the company could be reversing its opposition to a standard for accelerated 2D and 3D graphics on the Web. Microsoft's next version of Internet Explorer might just support WebGL &hellip;", "link": "http://news.cnet.com/8301-1023_3-57576954-93/change-of-heart-ie11-might-speed-web-graphics-with-webgl/", "cat": "news"}
{"title": "Showing Support for Marriage Equality on Facebook", "desc": "The U.S. Supreme Court this week met to begin debating the future of same-sex marriage in the United States.&nbsp; To accompany this historic event, the Human Rights Campaign (HRC) started urging people on Monday, March 25 to change &hellip;", "link": "http://www.facebook.com/notes/facebook-data-science/showing-support-for-marriage-equality-on-facebook/10151430548593859?_fb_noscript=1", "cat": "news"}
{"title": "Does Anyone Actually Want a &ldquo;Facebook Phone&rdquo;?", "desc": "Something Facebook mobile this way comes. And depending on what you read, it's a little different here and there.&nbsp; A proper Facebook phone.&nbsp; Or not a Facebook phone, but a very Facebook-y version of a phone.", "link": "http://allthingsd.com/20130329/does-anyone-actually-want-a-facebook-phone/", "cat": "news"}
